const price = [9.99, 1.5, 2.0, 3.0]
price.reduce((total, price) => total + price, 0)
/** (reduce) อาร์เรย์เป็นค่าเดียว Callback function: ฟังก์ชัน callback นี้จะถูกเรียกสำหรับแต่ละสมาชิกในอาร์เรย์ โดยมีการส่งค่าสองค่าคือ accumulator (ค่าที่เก็บผลลัพธ์รวม) และ current value (ค่าปัจจุบันของสมาชิกในอาร์เรย์) ฟังก์ชัน callback จะทำงานกับค่าเหล่านี้แล้วส่งค่าผลลัพธ์ในการทำงานของฟังก์ชัน callback คืนไปให้ accumulator.

Initial value (ค่าเริ่มต้น - optional): ค่าเริ่มต้นสำหรับ accumulator ถ้าไม่ระบุค่าเริ่มต้น ค่าแรกในอาร์เรย์จะถูกใช้เป็นค่าเริ่มต้น. */
