/*
* boolean logic comparisons */
/*
*เท่ากับ: == และ === ใช้สำหรับเปรียบเทียบความเท่ากันและความเท่ากันรวมถึงชนิดของข้อมูล. แต่== จะไม่เท่ากัน */
/*
*ไม่เท่ากับ: != และ !== ใช้สำหรับเปรียบเทียบความไม่เท่ากันและความไม่เท่ากันรวมถึงชนิดของข้อมูล. */
/*
*มากกว่า: > ใช้สำหรับเปรียบเทียบค่าทางซ้ายว่ามีค่ามากกว่าค่าทางขวาหรือไม่. */
/*
*น้อยกว่า: < ใช้สำหรับเปรียบเทียบค่าทางซ้ายว่ามีค่าน้อยกว่าค่าทางขวาหรือไม่. */
/*
*มากกว่าหรือเท่ากับ: >= ใช้สำหรับเปรียบเทียบค่าทางซ้ายว่ามีค่ามากกว่าหรือเท่ากับค่าทางขวาหรือไม่. */
/*
*น้อยกว่าหรือเท่ากับ: <= ใช้สำหรับเปรียบเทียบค่าทางซ้ายว่ามีค่าน้อยกว่าหรือเท่ากับค่าทางขวาหรือไม่. */
/*
*ตรรกะและ (AND): && ใช้สำหรับดำเนินการตรรกะและระหว่างสองนิพจน์ คืนค่าเป็น true ถ้าทั้งสองนิพจน์เป็น true. */
/*
*ตรรกะหรือ (OR): || ใช้สำหรับดำเนินการตรรกะหรือระหว่างสองนิพจน์ คืนค่าเป็น true ถ้านิพจน์ใดนิพจน์หนึ่งเป็น true. */
/*
*ตรรกะนิเสธ (NOT): ! ใช้สำหรับการเปลี่ยนแปลงค่าบูลีน คืนค่าเป็น true ถ้านิพจน์เป็น false และเป็น false ถ้านิพจน์เป็น true. */

/*
*ex */
const a = 5;
const b = 3;
const c = 7;
console.log(a == b);      // false
console.log(a !== b);     // true
console.log(a > b);       // true
console.log(b <= c);      // true
console.log(a === 5 && b === 3);   // true
console.log(a > 10 || c < 5);      // false
console.log(!(a === b));  // true
